花木兰是一位勇敢坚毅的年轻女子，她在战场上英勇作战，获得了十二次战功。尽管她有机会获得高官厚禄，但她只希望能够骑着千里马回到故乡。
可汗是国家的统治者，他赏识花木兰的勇敢和智慧，愿意给她丰厚的赏赐。在得知木兰的愿望后，他尊重她的选择，允许她骑着千里马回家。
木兰在战场上英勇作战，获得了十二次战功，赏赐无数。
可汗询问木兰的愿望，木兰表示只希望能够骑着千里马回到故乡。
可汗询问木兰的愿望，木兰表示只希望能够骑着千里马回到故乡。
战场上，硝烟弥漫，战鼓声震天。木兰身披铠甲，骑着战马，英勇无畏地冲锋陷阵。
可汗询问木兰的愿望，木兰表示只希望能够骑着千里马回到故乡。
[一个大帐篷里，可汗和士兵围着花木兰，赞扬花木兰的功绩。]
一个大帐篷里，可汗和士兵围着花木兰，赞扬花木兰的功绩。
多谢大家的厚爱，木兰不过是尽了自己的本分。希望你们也能平安归乡。
（挥舞着长枪，奋力冲锋）弟兄们，随我冲锋，打破敌军防线！
姐姐快回来了！我要把刀磨得锋利些，杀猪宰羊，好好庆祝一番！
你这孩子，别光顾着磨刀，等会儿帮忙准备其他东西。
知道了，娘。姐姐这次可真是立了大功，我一定要让她吃上最好的！
嗯，咱们一家人终于可以团聚了，真是太好了。
（紧随其后）木兰将军，冲啊！
（骑着千里马，身披战袍，走进家门）父亲，母亲，我回来了！
（激动地）木兰！你终于回来了！你让我们好担心啊！
（眼含热泪）木兰，我的好女儿，你平安归来就好，真是太好了！
（微笑着整理红妆）妹妹，欢迎回家！你在战场上辛苦了，现在终于可以好好休息了。
（手握磨好的刀）姐姐，我已经准备好了，今天我们要好好庆祝你的归来！
（笑着）谢谢你们，家人们。我在战场上最大的动力就是能够回到你们身边。
（骄傲地）木兰，你在战场上的英勇事迹我们都听说了，你是我们家的骄傲！
（慈爱地）是啊，木兰，你做得很好。现在，终于可以安心了。
（微笑着）木兰，我们都为你感到骄傲。来吧，换上轻便的衣服，今天我们要好好庆祝。
（笑着）好，那我就不客气了。谢谢你们，我的家人。
（兴奋地）对，姐姐，我们准备了很多好吃的，快来吧！
（高呼）木兰将军万岁！
（战鼓声震天，硝烟弥漫，敌军纷纷败退，木兰带领大军取得胜利）
（大帐内，面对木兰）木兰将军，你在战场上英勇无畏，屡立战功，朕赏赐你金银财宝、官职高位，你可有何愿望？
（点头微笑）木兰将军果然不同凡响。既如此，朕准你骑千里马回乡。
（木兰骑着千里马，穿过战场，奔向故乡）
（躬身行礼）谢可汗厚赐。臣不求高官厚禄，只愿能骑着千里马，回到故乡与家人团聚。
花木兰，你在战场上英勇作战，立下了十二次战功，赏赐无数。如今战事已平，我想听听你的愿望。你想要什么赏赐？
你不贪图荣华富贵，只愿回家，这份孝心令人敬佩。好，我成全你，赐你千里马，愿你早日与家人团聚。
大可汗，我不需要高官厚禄，只希望能够骑着千里马回到故乡，与家人团聚。
多谢大可汗恩赐，木兰感激不尽。
去吧，花木兰。愿你一路顺风，早日回到故乡。
（低声自语）战场上的厮杀、营帐中的夜谈，都成了回忆。现在，我只想快点见到爹娘、姐姐和弟弟。
（骑着千里马，满怀思念地看着前方）终于要回家了，这一路，仿佛用了我一生的时间。
（抬头望天）天啊，请保佑我的家人都平安无事。
（轻拍马背）千里马，我们再快一点，好吗？家就在前方了。
木兰她娘，你看那边是不是有一队人马？
（微笑）我能感觉到故乡的气息，真是久违的温暖。
是啊，是啊！我看到了，好像是朝我们这边来的。
心里真是又激动又紧张，盼了这么久，终于要见到我们的木兰了。
是啊，她在战场上英勇作战，立下了那么多战功，我们真是为她骄傲。
我也是，夜里常常梦见她能平安归来。如今梦成真了，我这心里可真是说不出的高兴。
但愿她能平安归来，这些年她吃了多少苦，我们做父母的心疼啊。
是啊，战场上的日子不好过。可我们的木兰是个坚强的孩子，她一定能克服一切困难。
看，那队人马越来越近了，我好像看到木兰了！
木兰！木兰！我们在这儿！
是的，是木兰！她回来了！我们的木兰回来了！
（拿起一支红色的口脂，轻轻涂抹在唇上）妹妹这次可真是给我们家争光了，我得好好打扮一下，迎接她的归来。
（整理着头发，轻轻叹气）木兰这些年在外面受了多少苦啊，现在终于可以回家了。
（拿起一面小镜子，仔细检查妆容）我得让她看到一个最美的姐姐，让她知道家里一直在等她。
（走到门口，望向远方）不知道她什么时候到，我要早点准备好，这样她一回来就能看到我。
（微笑着）木兰，你快回来吧，家里的一切都为你准备好了。
木兰，你在战场上英勇无比，十二次战功，赏赐无数。如今，你有何愿望？
谢可汗厚爱，木兰不求高官厚禄，只愿骑着千里马回到故乡，与家人团聚。
好！你忠心耿耿，功劳卓著，理应满足你的愿望。千里马已备好，愿你早日归家。
木兰将军，您真是我们的榜样！
对啊，木兰将军，您的英勇事迹我们都会铭记在心。
