[身强体壮且]勇敢的女战士，为了保护家人和国家而参军。她不要奖赏做大官，战袍来不及脱掉就快马加鞭的往家跑。
身强体壮且勇敢的女战士，为了保护家人和国家而参军。她不要奖赏做大官，战袍来不及脱掉就快马加鞭的往家跑。
花木兰的父亲，听说女儿凯旋归来，一大早就和妻子去城外迎接。
{花木兰的}父亲[身体不太好]，听说女儿{凯旋归}[回]来[了]，[所以很激动，起了]一大早{就和妻子}[，]去城外迎接[女儿]。
父亲身体不太好，听说女儿回来了，所以很激动，起了一大早，[和妻子一起]去城外迎接女儿。
[苍老的]父亲身体不太好，听说女儿回来了，所以很激动，起了一大早，和妻子一起去城外迎接女儿。
苍老的父亲[头发花白，]身体不太好，听说女儿回来了，所以很激动，起了一大早，和妻子一起去城外迎接女儿。
花木兰的母亲，听说女儿凯旋归来，一大早就和丈夫去城外迎接。
{花木兰的}姐姐[个子比较矮]，[所以她不能替父从军，]担心自己老了妹妹认不出自己，所以化了美美的妆。
姐姐个子比较矮，所以她不能替父从军，担心自己老了妹妹认不出自己，所以化了美美的妆。
花木兰不要奖赏做大官，战袍来不及脱掉就快马加鞭的往家跑。
花木兰不要奖赏做大官，战袍来不及脱掉就快马加鞭的往家跑。
花木兰不要奖赏做大官，战袍来不及脱掉就快马加鞭的往家跑。
木兰[抄近路走小道]回家[，马不停蹄的赶路，]
木兰抄近路走小道回家，马不停蹄的赶路{，}[。]
父母听说了木兰凯旋归来，一大早起来去城外迎接。
姐姐[身体矮小，擅长做家务，为家庭操劳，]怕自己老了妹妹认不出自己，所以化了美美的妆。
弟弟[虽然个子大，但没有花木兰灵活，]长大了能够杀猪宰羊，给姐姐做饭。
[乡村间的小路，路面不平，两旁都是生机勃勃的绿草]

[路面不平]
闺房内，木兰的姐姐正对着镜子仔细地化妆。房间里摆满了各式各样的化妆品和饰品，阳光透过窗户洒在她的脸上。
晨曦微露，城外的小道上，[路上有一颗大树，]木兰的父母正焦急地等待着。远处，草木间的鸟儿开始啼叫，空气中弥漫着清晨的露水味。
厨房里，木兰的弟弟正在忙碌地准备着一顿丰盛的饭菜。锅碗瓢盆的声音此起彼伏，厨房里弥漫着肉香。
木兰[的父亲和母亲]骑着马，身披战袍[的木兰牵着马]，终于到达了家门口。[在]家门口，{父母和}姐姐弟弟都在等待，家门上挂着红色的灯笼。
木兰的父亲和母亲骑着马，身披战袍的木兰牵着马，终于到达了家门口。在家门口，姐姐弟弟都在等待，家门上挂着红色的灯笼。
家中客厅里，木兰和家人们围坐在一起，共享一顿丰盛的晚餐。客厅里充满了欢声笑语，桌上摆满了美味的菜肴。
木兰抄近路走小道回家，马不停蹄的赶路。
（自言自语，眼神坚定）再快一点，再快一点，马上就能见到父母了。
唉，木兰这次打了这么多年的仗，不知道她还能不能认出我来。
这些年，我为了这个家，忙里忙外，连好好打扮的时间都没有。今天一定要好好化个妆，让木兰一眼就认出我。
嗯，这个胭脂颜色不错，涂上去显得气色好。还有这个发簪，木兰小时候最喜欢我戴这个了。
木兰一定长高了吧，不知道她有没有受伤。希望她能平安回来。
好了，妆也化好了，发簪也戴上了。木兰，你一定要快点回来，姐姐好想你。
姐姐今天就要回来了，我得赶紧准备好这顿饭。
（拿起一块肉）这块肉得切得薄一些，姐姐喜欢吃这种口感的。
（锅碗瓢盆的声音）哎呀，真是忙不过来。
（闻到肉香）嗯，这个味道不错，姐姐一定会喜欢的。
（擦了擦汗）姐姐，你快回来吧，我都迫不及待想看到你了。
木兰！你终于回来了！
孩子，娘好想你！
爹，娘，我回来了！
木兰，快看看我，还认得我吗？
姐姐，你化的妆真美，我怎么会认不出你呢？
姐姐，快进来吧，我给你准备了好吃的！
弟弟，你长大了，真是个好孩子！
快进家吧，外面风大。
是啊，进屋暖和暖和。
好，我也想家了。
木兰，快来坐下，今天我们特意准备了你最喜欢的菜。
木兰，真是辛苦你了。这些年在外面受了不少苦吧？
爹，娘，我没事的。这是我应该做的，为了保护家人和国家。
木兰，你看我化的妆好看吗？怕你认不出我了呢。
姐姐，你怎么会老呢？你一直都是我心中最美的。
姐姐，这些菜都是我准备的，特别是这道红烧肉，希望你喜欢。
弟弟，你真是长大了，竟然还会做饭了！
是啊，木兰，你不在的日子里，弟弟也学会了很多事情。
今天我们一家团聚，真是天大的喜事。来，大家一起举杯，为木兰的凯旋归来干杯！
谢谢大家，我真的很高兴能回到家里，和你们在一起。
对，姐姐，以后我们一起照顾爹娘，一起生活。
木兰，以后你就不用再出去了，安心在家里，我们一家人永远在一起。
嗯，我再也不会离开你们了。
（回忆）父亲母亲，他们一定在等我回家。我不要什么奖赏，只要一家团聚。
爹，娘，我回来了！
木兰，我的好女儿，快进来，爹想死你了！
弟弟，真是长大了，能干了！
木兰，娘每天都盼着你平安回来，今天终于见到你了！
姐姐，你化不化妆我都认得出你，还是那么漂亮！
木兰，你看我化了妆，你还认得出我吗？
姐姐，你回来啦！我已经长大了，会杀猪宰羊，今天给你做饭！
木兰，今天就好好休息，咱们一家人终于团聚了。
是啊，木兰，别再操心别的了，咱们现在只要过平静的生活就好。
我也去，我帮你们浇水。
（看向远方，疲惫但充满希望）这一路走来，多少风雨，多少战斗，终于要结束了。
嗯，爹娘，我这次回来就是想和你们一起过平静的日子。
好啊，姐姐，咱们一起去种花！
木兰，咱们一起去院子里种花吧，春天来了，花儿开得正好。
夫人，你说木兰什么时候能到？
你们去吧，我和你娘就在这儿看着你们，真好，真好。
是啊，这样的日子真是幸福。
应该快了吧，她可是骑着快马呢。
（加速马蹄）快，再快一点，家就在前方！
是啊，木兰从小就喜欢骑马。你看，这么多年过去了，她还是那样英勇。
快看，真的是木兰！她回来了！
（轻声）我回来了，父亲，母亲，姐姐，弟弟。
是啊，咱们的女儿真是了不起。你看那边，天边好像有个影子，莫非是木兰？
